IDENTIFICATION DIVISION.
PROGRAM-ID. CA11G115.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

SELECT TI001-PS ASSIGN TO INPAGTPS
    ORGANIZATION IS SEQUENTIAL
    ACCESS IS SEQUENTIAL
    FILE STATUS IS WS-FST-TI001.

SELECT TO001-KS ASSIGN TO OUTAGTKS
    ORGANIZATION IS INDEXED
    ACCESS IS RANDOM
    RECORD KEY IS AGENT-CODE1
    FILE STATUS IS WS-FST-TO001.

DATA DIVISION.

FILE SECTION.

FD TI001-PS.
01 TI001-PS-REC.
   05 AGENT-CODE     PIC X(05).
   05 FILLER         PIC X(01).
   05 POLICY-COUNT   PIC 9(03).
   05 FILLER         PIC X(01).
   05 AGENT-STATUS   PIC X(08).
   05 FILLER         PIC X(01).
   05 POLICY-TYPE    PIC X(09).
   05 FILLER         PIC X(01).
   05 COMMISION      PIC 9(03)V9(02).
   05 FILLER         PIC X(45).

FD TO001-KS.
01 TO001-KS-REC.
   05 AGENT-CODE1    PIC X(05).
   05 FILLER         PIC X(01).
   05 POLICY-COUNT1  PIC 9(03).
   05 FILLER         PIC X(01).
   05 AGENT-STATUS1  PIC X(08).
   05 FILLER         PIC X(01).
   05 POLICY-TYPE1   PIC X(09).
   05 FILLER         PIC X(01).
   05 COMMISION1     PIC 9(03)V9(02).
   05 FILLER         PIC X(01).
   05 TOTAL-COMM     PIC 9(07)V9(02).
   05 FILLER         PIC X(01).
   05 GRADE          PIC X(09).
   05 FILLER         PIC X(24).

WORKING-STORAGE SECTION.

01 WS-VAR.
   05 WS-FST-TI001 PIC 9(02).
      88 C05-TI001-SUCC VALUE 00.
      88 C05-TI001-EOF  VALUE 10.
   05 WS-FST-TO001 PIC 9(02).
      88 C05-TO001-SUCC VALUE 00.
      88 C05-TO001-EOF  VALUE 10.

01 WS-COMM1 PIC 9(03) VALUE ZEROES.
01 WS-COMM2 PIC 9(02) VALUE ZEROES.
01 WS-PC    PIC 9(03).
01 WS-CM    PIC 9(03)V9(02).
01 WS-TM    PIC 9(07)V9(02).

PROCEDURE DIVISION.

0000-MAIN-PARA.
    PERFORM 1000-INIT-PARA
    PERFORM 3000-PROC-PARA
    PERFORM 9000-TERM-PARA.

1000-INIT-PARA.
    CONTINUE.

3000-PROC-PARA.
    PERFORM 3100-OPEN-PARA
    PERFORM 3200-READ-PARA
        UNTIL C05-TI001-EOF
    PERFORM 3300-CLOSE-PARA.

9000-TERM-PARA.
    GOBACK.

3100-OPEN-PARA.
    OPEN INPUT TI001-PS
    IF NOT C05-TI001-SUCC
        DISPLAY "INPUT FILE OPEN FAILED: " WS-FST-TI001
        GOBACK
    END-IF

    OPEN OUTPUT TO001-KS
    IF NOT C05-TO001-SUCC
        DISPLAY "OUTPUT FILE OPEN FAILED: " WS-FST-TO001
        GOBACK
    END-IF.

3200-READ-PARA.
    MOVE SPACES TO TI001-PS-REC TO001-KS-REC
    READ TI001-PS
    EVALUATE TRUE
        WHEN C05-TI001-SUCC
            PERFORM 3210-VALID-PARA
        WHEN C05-TI001-EOF
            DISPLAY "ALL RECORDS PROCESSED"
        WHEN OTHER
            DISPLAY "TI001 READ FAILED: " WS-FST-TI001
    END-EVALUATE.

3210-VALID-PARA.
    MOVE COMMISION(1:3) TO WS-COMM1
    MOVE COMMISION(4:2) TO WS-COMM2

    IF POLICY-COUNT IS NUMERIC
       AND (AGENT-STATUS = "ACTIVE" OR AGENT-STATUS = "INACTIVE")
       AND POLICY-TYPE > ' '
       AND WS-COMM1 IS NUMERIC
       AND WS-COMM2 IS NUMERIC
        PERFORM 3220-PROCESS-PARA
    ELSE
        DISPLAY "DATA IS INVALID"
    END-IF.

3220-PROCESS-PARA.
    IF AGENT-STATUS NOT = 'INACTIVE'
        EVALUATE TRUE
            WHEN POLICY-COUNT < 300
                MOVE 'AVERAGE' TO GRADE
            WHEN POLICY-COUNT = 300
                MOVE 'GOOD' TO GRADE
            WHEN POLICY-COUNT > 300
                MOVE 'EXCELLENT' TO GRADE
        END-EVALUATE

        MOVE POLICY-COUNT TO WS-PC
        MOVE COMMISION TO WS-CM
        MOVE 0 TO WS-TM

        CALL "CA21G115"
            USING WS-PC WS-CM WS-TM

        MOVE AGENT-CODE   TO AGENT-CODE1
        MOVE POLICY-COUNT TO POLICY-COUNT1
        MOVE AGENT-STATUS TO AGENT-STATUS1
        MOVE POLICY-TYPE  TO POLICY-TYPE1
        MOVE COMMISION    TO COMMISION1
        MOVE WS-TM        TO TOTAL-COMM

        PERFORM 3230-WRITE-PARA
    END-IF.

3230-WRITE-PARA.
    WRITE TO001-KS-REC
    IF NOT C05-TO001-SUCC
        DISPLAY "WRITE FAILED " WS-FST-TO001
    END-IF.

3300-CLOSE-PARA.
    CLOSE TI001-PS TO001-KS.
