IDENTIFICATION DIVISION.
PROGRAM-ID. CA21G115.

DATA DIVISION.

LINKAGE SECTION.
01 LK-PLCY-CONT PIC 9(03).
01 LK-COMM      PIC 9(03)V9(02).
01 LK-TOT-COM   PIC 9(07)V9(02).

PROCEDURE DIVISION USING LK-PLCY-CONT LK-COMM LK-TOT-COM.

    COMPUTE LK-TOT-COM ROUNDED =
        LK-PLCY-CONT * LK-COMM

    GOBACK.
